//========================================================================================================================================================
import * as functions from "./modules/functions.js";
/* Проверка поддержки webp, добавление класса webp или no-webp для HTML */
/* (i) необходимо для корректного отображения webp из css  */
functions.isWebp();
/* Добавление класса touch для HTML если браузер мобильный */
functions.addTouchClass();
/* Добавление loaded для HTML после полной загрузки страницы */
functions.addLoadedClass();
/* Модуль для работы с меню (Бургер) */
functions.menuOpen();

//========================================================================================================================================================
/* Динамический адаптив */
// import "./libs/dynamic_adapt.js";

//========================================================================================================================================================
/* Слайдер Swiper */
// import "./libs/swiper.js";

//========================================================================================================================================================
// import * as Scroll from "./modules/scroll/scroll.js";

/* Наблюдатель за объектами c атрибутом data-watch */
// Для включения подсказок в консоли, указать  параметр true
// Scroll.scrollWatcher(false);

// Плавная навигация по странице
// Scroll.pageNavigation();

//========================================================================================================================================================
// Подключение споллеров
// functions.spollers();

//========================================================================================================================================================
// Подключение попапов
// import "./modules/popups.js";

//========================================================================================================================================================
/* Модуль для перевода страницы */
import "./modules/translate.js";

//========================================================================================================================================================
/* Подключение прочих скриптов */
import "./modules/script.js";
